sbsamed/STM32F4-Example/005_2_STD_MULTI_EXTERNAL_INTERRUPT/src/main.c
#include "stm32f4xx.h"
#include "stm32f4_discovery.h"

GPIO_InitTypeDef GPIO_InitStruct;
EXTI_InitTypeDef EXTI_InitStruct;
NVIC_InitTypeDef NVIC_InitStruct;

void delay(uint32_t time);

void GPIO_Config(){

	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOD,ENABLE);
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA,ENABLE);

	GPIO_InitStruct.GPIO_Mode=GPIO_Mode_OUT;
	GPIO_InitStruct.GPIO_Pin= GPIO_Pin_12 | GPIO_Pin_13 | GPIO_Pin_14 | GPIO_Pin_15 ;
	GPIO_InitStruct.GPIO_OType=GPIO_OType_PP;
	GPIO_InitStruct.GPIO_PuPd=GPIO_PuPd_NOPULL;
	GPIO_InitStruct.GPIO_Speed=GPIO_Speed_100MHz;

	GPIO_Init(GPIOD,&GPIO_InitStruct);

	GPIO_InitStruct.GPIO_Mode=GPIO_Mode_IN;
	GPIO_InitStruct.GPIO_Pin= GPIO_Pin_1 | GPIO_Pin_2 ;
	GPIO_InitStruct.GPIO_OType=GPIO_OType_PP;
	GPIO_InitStruct.GPIO_PuPd=GPIO_PuPd_DOWN;
	GPIO_InitStruct.GPIO_Speed=GPIO_Speed_100MHz;

	GPIO_Init(GPIOA,&GPIO_InitStruct);

}
void EXTI_Config(){

	RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG,ENABLE);

	SYSCFG_EXTILineConfig(EXTI_PortSourceGPIOA,GPIO_PinSource1);
	SYSCFG_EXTILineConfig(EXTI_PortSourceGPIOA,GPIO_PinSource2);


	EXTI_InitStruct.EXTI_Line=EXTI_Line1 | EXTI_Line2;
	EXTI_InitStruct.EXTI_LineCmd=ENABLE;
	EXTI_InitStruct.EXTI_Mode=EXTI_Mode_Interrupt;
	EXTI_InitStruct.EXTI_Trigger=EXTI_Trigger_Rising;

	EXTI_Init(&EXTI_InitStruct);

	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_1);

	NVIC_InitStruct.NVIC_IRQChannel=EXTI1_IRQn;
	NVIC_InitStruct.NVIC_IRQChannelCmd=ENABLE;
	NVIC_InitStruct.NVIC_IRQChannelPreemptionPriority=0;
	NVIC_InitStruct.NVIC_IRQChannelSubPriority=0;

	NVIC_Init(&NVIC_InitStruct);


	NVIC_InitStruct.NVIC_IRQChannel=EXTI2_IRQn;
	NVIC_InitStruct.NVIC_IRQChannelCmd=ENABLE;
	NVIC_InitStruct.NVIC_IRQChannelPreemptionPriority=1;
	NVIC_InitStruct.NVIC_IRQChannelSubPriority=0;

	NVIC_Init(&NVIC_InitStruct);



}

void EXTI1_IRQHandler(){

	if( EXTI_GetITStatus(EXTI_Line1)!=RESET ){

		GPIO_ResetBits(GPIOD,GPIO_Pin_12 | GPIO_Pin_13 | GPIO_Pin_14 | GPIO_Pin_15);

		GPIO_SetBits(GPIOD,GPIO_Pin_12);
		delay(1680000);
		GPIO_SetBits(GPIOD,GPIO_Pin_13);
	    delay(1680000);
	    GPIO_SetBits(GPIOD,GPIO_Pin_14);
	    delay(1680000);
		GPIO_SetBits(GPIOD,GPIO_Pin_15);
		delay(1680000);

		EXTI_ClearITPendingBit(EXTI_Line1);

	}
}

void EXTI2_IRQHandler(){

	if( EXTI_GetITStatus(EXTI_Line2)!=RESET ){

		GPIO_ResetBits(GPIOD,GPIO_Pin_12 | GPIO_Pin_13 | GPIO_Pin_14 | GPIO_Pin_15);

		GPIO_SetBits(GPIOD,GPIO_Pin_15);
		delay(1680000);
		GPIO_SetBits(GPIOD,GPIO_Pin_14);
	    delay(1680000);
	    GPIO_SetBits(GPIOD,GPIO_Pin_13);
	    delay(1680000);
		GPIO_SetBits(GPIOD,GPIO_Pin_12);
		delay(1680000);

		EXTI_ClearITPendingBit(EXTI_Line2);

	}
}
void delay(uint32_t time){
	while(time--);
}
int main(void)
{

  while (1)
  {
	  GPIO_ResetBits(GPIOD,GPIO_Pin_12 | GPIO_Pin_13 | GPIO_Pin_14 | GPIO_Pin_15);
  }
}


void EVAL_AUDIO_TransferComplete_CallBack(uint32_t pBuffer, uint32_t Size){

  return;
}

uint16_t EVAL_AUDIO_GetSampleCallBack(void){

  return -1;
}
